stubs/__files/partner/dgf/activation/OAL-Activation-ERLM.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ns2="http://spri.telekom.de/oss/v5/envelopeOal">
    <soapenv:Header/>
    <soapenv:Body>
        <ns2:annehmenMeldungRequest xmlns:ns2="http://spri.telekom.de/oss/v5/envelopeOal"
                                    xmlns:ns4="http://spri.telekom.de/oss/v5/messageOal"
                                    xmlns:complexOal="http://spri.telekom.de/oss/v5/complexOal">
            <control>
                <zeitstempel>{{now format='yyyy-MM-dd'}}T{{now format='HH:mm:ss.SSS'}}</zeitstempel>
                <majorRelease>04</majorRelease>
                <minorRelease>90</minorRelease>
                <signaturId>
                    <issuer>DTAG</issuer>
                    <serial>123456</serial>
                </signaturId>
            </control>
            <meldung>
                <auftragstyp>
                    <geschaeftsfall>NEU</geschaeftsfall>
                    <aenderungsKennzeichen>Standard</aenderungsKennzeichen>
                    <geschaeftsfallart>Bereitstellung</geschaeftsfallart>
                </auftragstyp>
                <meldungstyp xsi:type="ns4:MeldungstypERLMType" xmlns:ns4="http://spri.telekom.de/oss/v5/messageOal"
                             xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                    <meldungsattribute>
                        <vertragsnummer>6923119</vertragsnummer>
                        <externeAuftragsnummer>{{soapXPath request.body '/annehmenAuftragRequest/auftrag/externeAuftragsnummer/text()'}}</externeAuftragsnummer>
                        <auftraggebernummer>2020005101</auftraggebernummer>
                        <erledigungstermin>2021-05-07</erledigungstermin>
                        <anschluss xsi:type="complexOal:OalAnschlussType">
                            <schaltangabenNga xsi:type="complexOal:OalSchaltangabenType">
                                <standortBName>POP-Lüdighausen-4711</standortBName>
                                <rack>34-53</rack>
                                <port>0815-23-47</port>
                                <ppid>{{eq (persist key='dgf_ppid') null yes=(randomValue length=7 type='NUMERIC') no=(persist key='dgf_ppid')}}</ppid>
                            </schaltangabenNga>
                            <schaltangabenAne>
                                <standortBName>lhn-002</standortBName>
                                <raum>A</raum>
                                <rack>1</rack>
                            </schaltangabenAne>
                            <homeId>
                                <homeIdNummer>{{randomValue length=8 type='NUMERIC'}}</homeIdNummer>
                            </homeId>
                            <leitungsbezeichnung>DEU.DGW.G50ED155EN</leitungsbezeichnung>
                            <patchService>supplier</patchService>
                        </anschluss>
                    </meldungsattribute>
                    <meldungspositionen>
                        <position>
                            <meldungscode>0010</meldungscode>
                            <meldungstext>Auftrag  ausgeführt.
                            </meldungstext>
                        </position>
                    </meldungspositionen>
                </meldungstyp>
            </meldung>
        </ns2:annehmenMeldungRequest>
    </soapenv:Body>
</soapenv:Envelope>